---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PipeFittingAndAccessoryPressureDropUIDataItem Properties
PipeFittingAndAccessoryPressureDropUIDataItem Class See Also Send Feedback
---

The PipeFittingAndAccessoryPressureDropUIDataItem type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PipeFittingAndAccessoryPressureDropUIDataItem Class

Autodesk.Revit.UI.Plumbing Namespace